/********************************************************************************
CopyRight  : 2012-2013, HerBinUnversity, GatieMe
File Name  :【00】ACM模版
Description: 用于详细说明此程序文件完成的主要功能, 与其他模版或函数的接口、
             输出值、取值范围、含义及参数间的控制、顺序、独立或依赖等关系
Author     : Gatie_Me
Version    : 版本声明
Data_Time  : 20112-8-4 15:36:24
Content    : 哈工程Acm——Problem List【1005Beavergnaw】
History    : 详细信息如下
Problem Url: http://acm.hrbeu.edu.cn/index.php?act=problemlist
********************************************************************************/

/********************************************************************************
History    :修改历史记录列表, 每条修改记录应包括修改日期、修改者以及修改内容
********************************************************************************/

/********************************************************************************
Problem    :ACM题目信息的详细描述
********************************************************************************/




#include <iostream>
#include <algorithm>
#include <cstdio>
#include <cstdlib>
#include <cmath>

using namespace std;


//主函数
int main( )
{
    int a, b;
    while( scanf("%d%d", &a,&b) != EOF )
    {
        printf("%d\n", a+b);
    }
    return 0;    //主函数成功返回
}



///函数注释
/**********************************************************************
Function      :      ///函数名称
Description   :      ///函数功能、性能等的描述
Calls         :      ///被本函数调用的函数清单
Called By     :      ///调用本函数的函数清单
Table Accessed:      ///被反问的表（此项仅对于牵扯到数据库操作的程序）
Table Update  :      ///被修改的表（此项仅对于牵扯到数据库操作的程序）
Input         :      ///对输入参数的说明, 包括每个参数的作用、取值说明及参数间的关系
Output        :      ///对输出参数的说明
Return        :      ///函数返回值的说明
Others        :      ///其他说明
**********************************************************************/
